# 有下列人员数据库，请按要求实现
# # 姓名  年龄  性别  编号   任职公司   薪资   部门编号
# names = [
#     ["曹操","56","男","106","IBM", 500 ,"50"],
#     ["大乔","19","女","230","微软", 501 ,"60"],
#     ["小乔", "19", "女", "210", "Oracle", 600, "60"],
#     ["许褚", "45", "男", "230", "Tencent", 700 , "10"]
# ]
# 1.统计每个人的平均薪资
# 2.统计每个人的平均年龄
# 3.公司新来一个员工，刘备，45，男，220，alibaba，500,30，添加到列表中
# 4.统计公司男女人数
# 5.每个部门的人数
names = [
    ["曹操", "56", "男", "106", "IBM", 500, "50"],
    ["大乔", "19", "女", "230", "微软", 501, "60"],
    ["小乔", "19", "女", "210", "Oracle", 600, "60"],
    ["许褚", "45", "男", "230", "Tencent", 700, "10"]
]

l = 0
s = 0
while l < 4:
    s = (int(names[l][5])) + s
    l = l + 1
print("每个人的平均薪资为:", s / 4)

i = 0
m = 0
while i < 4:
    m = (int(names[i][1])) + m
    i = i + 1
print("每个人的平均年龄为:", m / 4)

lb = ["刘备", "45", "男", "220", "alibaba", "500", "30"]
names.append(lb)
for k in names:
    print(k)
# 添加到列表中


n = 0
q = 0
nan = 0
nv = 0
while n < 5:
    q = (str(names[n][2]))
    if q == "男":
        nan = nan + 1
    if q == "女":
        nv = nv + 1
    n = n + 1
print("公司的男生人数为：", nan, "公司的女生人数为：", nv)