# # 现在魔法学院有赫敏、哈利、罗恩、马尔福四个人的几次魔法作业的成绩。但是呢，因为有些魔法作业有一定难度，教授不强制同学们必须上交，所以大家上交作业的次数并不一致。
# # [罗恩, 23 ,35 ,44]
# # [哈利 ,60, 77 ,68 ,88, 90]
# # [赫敏, 97 ,99 ,89 ,91, 95, 90]
# # [马尔福 ,100, 85 ,90]
# # 求每个人的总成绩？
# list1 = [
#     ['罗恩', 23, 35, 44],
#     ['哈利', 60, 77, 68, 88, 90],
#     ['赫敏', 97, 99, 89, 91, 95, 90],
#     ['马尔福', 100, 85, 90]
# ]
# r = 0
# s = 0
# n = 0
# while r < 4:
#     print(str(list1[r][0]), "的总成绩为:")
#     r = r + 1
# list1(0)


list1 = [
    ["罗恩", 23, 35, 44],
    ["哈利", 60, 77, 68, 88, 90],
    ["赫敏", 97, 99, 89, 91, 95, 90],
    ["马尔福", 100, 85, 90]
]

for i in range(len(list1)):
    s = 0
    for j in range(len(list1[i])):
        j = j + 1
        if j == len(list1[i]):
            continue
        else:
            s = s + int(list1[i][j])
    if i == 0:
        print("罗恩的总成绩为:", s)
    elif i == 1:
        print("哈利的总成绩为:", s)
    elif i == 2:
        print("赫敏的总成绩为:", s)
    elif i == 3:
        print("马尔福的总成绩为:", s)
